app/Controllers/Countries.php

    public function getAll()
    {
        helper(['form', 'url']);

        $data = [];

        $db      = \Config\Database::connect();
        $builder = $db->table('countries');

        $query = $builder
                    ->select('id, concat(country_code, "|", country_name) as text')
                    ->limit(30)->get();
---
SELECT `id`, concat(country_code, "|", country_name) as text
FROM `countries`
 LIMIT 30