app/Controllers/Department.php

SELECT `id`, `dept_name` as `text`
FROM `department_master`
WHERE `dept_name` LIKE '%a%' ESCAPE '!'
 LIMIT 30
---
    public function getAll()
    {
        helper(['form', 'url']);

        $data = [];

        $db      = \Config\Database::connect();
        $builder = $db->table('department_master');

        $query = $builder
            ->select('id, concat(dept_code, "|", dept_name) as text')
            ->limit(30)->get();