app/Controllers/Item.php

    public function getAll()
    {
        helper(['form', 'url']);

        $data = [];

        $db      = \Config\Database::connect();
        $builder = $db->table('item_master');

        $query = $builder
                ->select('id, concat(item_code,"|",item_name_1) as text')
                ->limit(30)->get();
---
SELECT `id`, concat(item_code, "|", item_name_1) as text
FROM `item_master`
 LIMIT 30