app/Controllers/TransactionCode.php

    public function getAll()
    {
        helper(['form', 'url']);

        $data = [];

        $db      = \Config\Database::connect();
        $builder = $db->table('transaction_code');

        $query = $builder
                ->select('id, concat(transcode,"|", transname) as text')
                ->limit(30)->get();
---
SELECT `id`, concat(transcode, "|", transname) as text
FROM `transaction_code`
 LIMIT 30