app/Controllers/UOM.php

SELECT `id`, concat(uom_code, "|", uom_desc) as text
FROM `uom`
 LIMIT 30
---
    public function getAll()
    {
        helper(['form', 'url']);

        $data = [];

        $db      = \Config\Database::connect();
        $builder = $db->table('uom');

        $query = $builder
                    ->select('id, concat(uom_code,"|", uom_desc) as text')
                    ->limit(30)->get();