app/Models/BOMChildModel.php

SELECT *
FROM `bom_child`
ORDER BY `id` ASC
 LIMIT 10
---
    public function getDatatables()
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->get();

SELECT COUNT(*) AS `numrows`
FROM `bom_child`
---
    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `bom_child`
---
    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();

SELECT *
FROM `bom_child`
WHERE `bom_id` = '1'
ORDER BY `id` ASC
 LIMIT 10
SELECT *
FROM `bom_child`
WHERE `id` = '1'
---
    public function getDatatablesByBOM($id)
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->where('bom_id', $id)->get();
        return $query->getResult();

SELECT COUNT(*) AS `numrows`
FROM `bom_child`
WHERE `bom_id` = '1'
---
    public function countFilteredByBOM($id)
    {
        $this->getDatatablesQuery();
        return $this->dt->where('bom_id', $id)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `bom_child`
WHERE `bom_id` = '1'
---
    public function countAllByBOM($id)
    {
        $tbl_storage = $this->db->table($this->table)->where('bom_id', $id);
        return $tbl_storage->countAllResults();

SELECT *
FROM `bom_child`
WHERE `id` = '3'
---
    public function getBOMChild($id = '')
    {
        $this->dt->where('id', $id);
        $query = $this->dt->get();