app/Models/BOMModel.php

    public function getBOM($id = '')
    {
        $this->dt->where('id', $id);
        $query = $this->dt->get();
---
SELECT *
FROM `bom`
WHERE `id` = '1'