app/Models/CompanyModel.php

SELECT COUNT(*) AS `numrows`
FROM `company_master`
---
    public function getCompany($id = '')
    {
        $this->dt->select('company_master.*, concat(countries.country_code,"|",countries.country_name) as country, concat(provinces.province_code,"|",provinces.province_name)  as province, concat(cities.city_code,"|",cities.city_name) as city');