app/Models/InvTransModel.php

    public function getDatatables()
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
---
SELECT *
FROM `invtrans`
ORDER BY `id` ASC
 LIMIT 10

    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `invtrans`