app/Models/ProvincesModel.php

    public function getProvinces($id = '')
    {
        $this->dt->select('provinces.id, province_code, province_name, country_id, provinces.active, countries.country_name as country');
        $this->dt->join('countries', 'countries.id = provinces.country_id');
        $this->dt->where('provinces.id', $id);
        $query = $this->dt->get();
---
SELECT `provinces`.`id`, `province_code`, `province_name`, `country_id`, `provinces`.`active`, `countries`.`country_name` as `country`
FROM `provinces`
JOIN `countries` ON `countries`.`id` = `provinces`.`country_id`
WHERE `provinces`.`id` = '3610'