app/Models/TransactionCodeModel.php

SELECT *
FROM `transaction_code`
WHERE `id` = '1'
---
    public function getTransactionCode($id = '')
    {
        $this->dt->where('id', $id);
        $query = $this->dt->get();