app/Models/UOMModel.php

    public function getDatatables()
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->get();
---
SELECT *
FROM `uom`
ORDER BY `id` ASC
 LIMIT 10

    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `uom`

    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `uom`

    public function getUOM($id = '')
    {
        $this->dt->where('id', $id);
        $query = $this->dt->get();
---
SELECT *
FROM `uom`
WHERE `id` = '7'