app/Models/WorkCenterModel.php

SELECT *
FROM `work_center`
WHERE `id` = '1'
---
    public function getWorkCenter($id = '')
    {
        $this->dt->where('id', $id);
        $query = $this->dt->get();