app/Models/WorkCenterCostModel.php

    public function getDatatablesByWorkCenter($id)
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
---
SELECT *
FROM `work_center_cost`
WHERE `work_center_id` = '1'
ORDER BY `id` ASC
 LIMIT 10

    public function countFilteredByWorkCenter($id)
    {
        $this->getDatatablesQuery();
        return $this->dt->where('work_center_id', $id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `work_center_cost`
WHERE `work_center_id` = '1'

    public function countAllByWorkCenter($id)
    {
        $tbl_storage = $this->db->table($this->table)->where('work_center_id', $id);
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `work_center_cost`
WHERE `work_center_id` = '1'